{
  "AdonisJS": "<b>Adonis.js</b> is what people call “stylish, trendy, and youthful.” When I need to build a sleek backend in JavaScript, I go for it instead of the old-timer Express.js. I only got to know Adonis recently, but we’re already as close as lifelong pals. Right, Adonis? 😅",
  "AePr": "There are two things I’m obsessed with. At the top of the list is programming. And in second place, it’s motion design. Well, and regular design too, but that’s another topic. I know <b>After Effects</b> and <b>Premiere Pro</b> like the back of my hand and have been creating content with them since high school. With every new project, my skills improve, and that incredible feeling of growth never gets old. I also love sneaking little Easter eggs into my work – tiny details only the most observant will catch! The only downside is finding the time for it because working as a programmer doesn’t leave much room for anything else. Oh, and just between us, I can crack almost any paid plugin – but shhh, don’t tell anyone!",
  "Android": "There's our old buddy <b>Android Studio</b>! While some developers might dread those notorious Gradle sync times, I've learned to see them as coffee break opportunities! Been wrestling with layouts, activities, and fragments since the days when I had to write projects in Java. Still remember the satisfaction of getting my first RecyclerView to work properly. And don't even get me started on those endless SDK updates – I think I've downloaded half the internet just keeping up with them! Always fun explaining to non-dev friends why my laptop sounds like it's about to take off during build times.",
  "Au": "<b>Adobe Audition</b> – oh yeah, that's in my toolkit too! I dabble with it occasionally when I need to clean up some audio or splice together a few tracks. Sure, I'm no audio wizard, but I know my way around the basics – noise reduction, effects editing, that sort of thing. I can even turn a regular audio clip into a spatial sound that'll spin around your head like an annoying fly! And hey, I've even made a few sound effects for my games and guess what, for this portfolio too!",
  "CArduino": "<i>The Holy C</i>, Fireship’s favorite language... Oh, wait, it’s just a regular <b>C</b>. Or rather, I meant the <b>Great C</b>, the one that offers limitless low-level capabilities! Most of my time in university was spent coding in it, often using the SDL graphics library. I also worked on several Arduino projects – there’s something magical about writing code that makes physical things move. I know my way around it pretty well, but these days, I hardly use it. Still, every now and then, I get the urge to relive that feeling of total control, when you manipulate memory as you please and make every byte count.",
  "Cinema4D": "While Blender's my main squeeze these days, <b>Cinema4D</b> and I had our moments, especially when After Effects needed some 3D graphics. The integration between these two was smooth as butter! But you know how it goes – Blender stole my heart with its price tag (or lack thereof) and endless possibilities. Still, I've got to give C4D credit where it's due: those MoGraph tools were something else, and the learning curve was gentler than climbing a small hill. Not like Blender's initial “welcome to Mt. Everest” experience!",
  "Docker": "Ah, you've spotted the <b>Docker</b> whale, despite its quite small size! Yeah, nice joke, keep it up... Anyway, seems like it has some kind of manuscript, let's see...<hr><pre><span class=\"blue\">MAINTAINER</span> Relativity Codes ukweheverest@gmail.com<br><span class=\"blue\">FROM</span> my-experience<br><span class=\"blue\">COPY</span> years-of-containerization .<br><span class=\"blue\">RUN</span> microservices<br><span class=\"blue\">EXPOSE</span> everything-i-know<br><br># And yet I wouldn't have it any other way!<br><span class=\"blue\">ENV</span> DOCKER_COMPOSE=second-nature<br><br># Need a fresh dev environment? No problem!<br># Want to test that new framework?<br># Just spin up a CONTAINER!<br><br><span class=\"blue\">ENTRYPOINT</span> [\"office-space\"]<br><span class=\"blue\">CMD</span> [\"me start coding\"]",
  "Ferris": "I don’t have much <b>Rust</b> experience yet, but it’s my top priority for skill improvement right now. Once I’ve gained enough experience, then, I suppose, like any self-respecting rustacean, I will rush to rewrite all my projects in Rust.<br>Oh, and look! See that? <b>Ferris</b> is writing my name! That means it believes in me! Woohoo!",
  "Ffmpeg": "<b>FFmpeg</b> is here to show off its media processing skills. It’s a powerful tool that I’ve been using for a long time to convert, cut, and merge video and audio files in my projects. Sure, its command syntax might look like ancient runes to newcomers, but hey, that's part of its charm! ",
  "Git": "<b>Git</b>! Not just an average version control system – it's my digital time machine. Sure, everyone knows push and pull, but I've gone way deeper down the rabbit hole. Custom aliases that make my workflow sing, pre-commit hooks with Husky keeping my code squeaky clean, and interactive rebases that make my history really beautiful. Been crafting the perfect <code>.gitconfig</code> for years now. Don't even get me started on my collection of git aliases that would make Linus Torvalds proud.",
  "GitLab": "They say that if you configure <b>GitLab</b> CI/CD properly, you can achieve automation zen. Yes, the kind where your code gets tested, built, and deployed while you sit back and sip coffee. I think I’ve gotten pretty good at it, though I admit I still haven’t explored all its features.<br>So where’s GitHub in all this? It definitely deserves its place on this island, but I’ll add it as the project evolves and after some successful code reviews.<br><pre class=\"green\">// TODO: delete the lines above after adding the GitHub model.</pre>",
  "Graphql": "Want to talk about modern APIs? Well, here we have the whole gang! <b>GraphQL</b> with its powerful queries – been using it whenever REST feels too rigid. You know that feeling when you need exactly three fields from twenty? That's when I bring in GraphQL! Right next to it, good old <b>WebSockets</b> keeps the real-time party going – can't build a decent chat or live dashboard without them these days. And look at the <b>gRPC</b> with its Protocol Buffers and his bro <b>tRPC</b> – super fast, strongly typed, and way more elegant than REST when you're dealing with service-to-service communication.",
  "JSCastle": "This is a <u>Jsand Castle</u>. Its defining feature, unlike other castles, is the mysterious energy orb at the top, which appeared after the arrival of a lizard person being calling itself Zuckerberg.<br><u>Click on it</u> if you want to dive into the mysteries of this castle! Wooo!",
  "JSPennant": "What’s the <b>JavaScript</b> logo doing here? Oh, right, this is the <u>Jsand Castle</u>... But let’s be honest: <b>TypeScript</b> deserves the spotlight here since that’s what I use to write applications. No offense to JavaScript, but your <code>[] + 2 = \"2\"</code> nonsense is just horrifying 😬.",
  "Java": "Why does <b>Duke</b>, the <b>Java</b> mascot, leap over Laravel? It’s not about rivalry – it’s about showing off some impressive cross-framework parkour skills. Because, really, who says Java can’t have a little fun in PHP’s playground?<br>I know Java decently well, having about a year of experience in Android development.<br>What? You think I should’ve added a 3D Android model then? Nah, too mainstream. There are hundreds of Android models, but Duke? He’s one of a kind!",
  "Kafka": "And here we have <b>Kafka</b>, hiding in plain sight! More than just a message broker – it's the backbone of my event-driven architectures. Stream processing, pub/sub messaging, event sourcing – you name it, Kafka handles it like a champ. I've spent many hours fine-tuning those partition configurations and consumer group settings. And let's be honest, watching those offsets tick up in real-time is oddly satisfying. Though I still sometimes catch myself double-checking if my retention policies are set right... just in case!",
  "Laravel": "Recognize it? It’s <b>Laravel</b>! If it doesn’t look familiar, try looking at it from a different angle.<br>Laravel is that friend who always offers the best advice. And his assistant, Artisan, will do whatever you ask, whether it’s creating migrations or spinning up a server. With Laravel, I forget all the old prejudices about PHP and happily build backend applications again and again. These days, I prefer other languages, but if I ever return to PHP, it’ll undoubtedly be with good old Laravel.",
  "MariaDB": "The sea lion who doesn’t spin a circus hoop on its nose – because this is <b>MariaDB</b>! It’s like a younger sister who grew up and surpassed her older brother, MySQL. With replication, virtual columns, JSON support, and excellent performance on large datasets, it’s all here. I often use it as the primary database in my projects.",
  "Mongo": "Who’s hiding over there? Ah, it’s <b>MongoDB</b> itself, the star of NoSQL databases. If you need to store data in JSON and access it instantly, it’s my go-to. Arrays in documents? No problem. Dynamic schema? Of course. Replication, sharding, and a convenient query language? Yes, yes, and yes again! I’ve known MongoDB for several years and can confidently say it’s perfect for those cases when relational databases choke you with their rigid structure.",
  "MySQL": "The good old dolphin named <b>MySQL</b> – an old-timer and veteran among relational databases. I know MySQL inside and out, from the simplest <code>SELECT</code> queries to index optimization and replication setup. I even had to sweat it out and write a custom shader to make it look exactly like the logo. Proud of myself for that ☺️.",
  "NextJS": "<b>Next.js</b>, the framework that makes React even better! Want to quickly whip up a full-stack app without worrying about frontend-backend interaction? Then Next.js is the way to go! I’ve been using it for more than 2 years and have noticed its rapid development.",
  "Nginx": "Just look at that <b>Nginx</b> over there! Been my trusty sidekick since I first learned what a web server was. Seriously, it's like that old friend who's been there through everything – reverse proxying, load balancing, serving static files at lightning speed. I've configured it so many times I could probably write <code>nginx.conf</code> in my sleep! And those location blocks? They're basically my second language at this point. I've got to admit, seeing that signature green-white logo always brings a smile to my face. Apache who? 😉",
  "Node": "Do you know what this is? It’s the <b>Node.js</b> mascot! Congrats, now you know what it looks like! And this is, most likely, the only 3D model of it in the world. Phew 😅. It’s here just to show off how beautiful it is! And if you want to know more about JavaScript, head slightly to the right, near that curious penguin.",
  "PHP": "<i>Roses are <span class=\"red\">red</span>.<br>Elephants are <span class=\"blue\">blue</span>.<br>It’s not the best language,<br>But it gets the job through.</i><hr>PHP was my first language for commercial development. Back then, it was pretty... rough. But with each new version, it clearly got better, and eventually, it became enjoyable to work with, hehe. PSR-4, autoloading, packages – PHP taught me how to keep my code organized. And when I first discovered the world of ORM through Eloquent, I thought I’d never write SQL manually again (well, almost).",
  "PostgreSQL": "And here’s <b>PostgreSQL</b>, or just Postgres, for friends. It’s not just a database – it’s a versatile tool for working with data. Storing complex structures? Easy. Extensions and geodata support? Sure thing. JSONB, ACID-level transactions, and incredible stability? Yep, that’s all about Postgres. Honestly, if I had to choose just one database for life, I’d think long and hard, but I’d probably choose this one.",
  "PsAi": "What was I saying about regular design? Oh right – give me an idea and some time, and I can create an awesome vector logo, sticker, or banner in <b>Adobe Illustrator</b>! As for <b>Photoshop</b>, I probably don’t even need to mention it. Mastering such a powerful tool is a must for anyone who can independently create commercial products from start to finish. And I believe I meet those criteria. I’ve been using both programs for years, and I’m always looking for new ways to improve my skills.",
  "Pt": "And there's <b>Substance Painter</b> – my go-to accomplice whenever Blender's materials just aren't cutting it! You know that magical moment when you transform a plain 3D model into something that looks like it could jump right off the screen? Between its smart materials and painting directly on UV maps, it's become an essential part of my workflow. Though I probably spend way too much time tweaking roughness maps and playing with height details, but when those textures finally load back into Blender, it's always worth it!",
  "Python": "Did you notice on the island in the shape of what you are? That's right, and its name is <u>Pyland</u>! Been slinging Python code for what feels like forever. <b>Django</b> was my first love in the web framework world. I often use <b>FastAPI</b> when I need something lightweight.\n<b>Aiogram</b> turned me into a Telegram bot wizard. And that's the data science trio – <b>Pandas</b> for wrestling data into submission, while <b>TensorFlow</b> and <b>PyTorch</b> let me dabble in AI when I'm feeling particularly ambitious. That let you go from <code>import torch</code> to training a model that can turn your selfie into a Hayao Miyazaki's masterpiece!",
  "React": "The mighty and powerful <b>React</b>! You were my first framework and will forever hold a special place in my heart. I’ve known you for over 4 years, and you’re the best thing lizards have ever given developers.",
  "Redis": "<b>Redis</b> is my favorite in-memory speedster! Whether it's session storage, real-time analytics, or queue management, I've used Redis so much that I dream in INCR and ZADD commands. And let's be honest – nothing beats that feeling when you watch your application's response time drop to milliseconds after adding Redis to the mix!",
  "SolidJS": "Now, presenting my favorite framework of the moment: <b>Solid.js</b>! It takes all the best from React and other frameworks while staying fast, lightweight, and free of unnecessary fluff. I’ve been building projects with it for over 5 years now.",
  "Suzanne": "This head? That’s <b>Suzanne</b>, which means it’s time to talk about <b>Blender</b>. I don’t use it often, but when I do, I use it well. In total, I’ve been dabbling with it on and off for about 5 years, so I know my way around it pretty well. You can draw your own conclusions from this entire scene. Almost all the 3D models and animations here are my work.",
  "ThreeJS": "<b>Three.js</b> is what you turn to when ordinary web contexts start feeling too dull. That’s when you fire up GLSL add-ons in VSCode, open Blender, and create wonders. And let me say this: after making this portfolio page, I feel capable of almost anything. Hehe.",
  "TonBtc": "My fascination with Telegram left its mark, and ever since Pavel Durov created <b>TON</b>, I’ve been diving into how cryptocurrency works. Specifically, I’ve developed a deep understanding of the principles behind the TON blockchain with its elegant Proof-of-Stake consensus. I’ve integrated crypto payments into Telegram bots using personal lite-servers, contributed to the development of a Python library for interacting with the blockchain, and even created my own Jettons for decentralized apps. And of course, I’ve also studied how the <b>Bitcoin</b> network works – the granddaddy of all cryptocurrencies!",
  "Tux": "And of course, we can’t forget <b>Tux</b>, everyone’s favorite Linux mascot! I know how to change directories with the <code>cd</code> command, can you imagine? Beyond that, I can spin up microservice clusters, set up CI/CD pipelines, ensure fault tolerance with load balancers, and optimize database performance through sharding. Naturally, all this happens after I find where my USB drive with the live distribution disappeared to.",
  "Umbrella": "Just a completely ordinary beach umbrella. You don’t think there’s anything special about it, do you? Even if you <u>click on it</u>?",
  "UnitySharp": "<b>C#</b> and <b>Unity</b> – that's where my coding journey began, back in high school! Picture baby's first steps, but with semicolons and MonoBehaviours. I've moved on to other languages since then, but C# was my first programming crush, it taught me what coding was all about. However, I think I could go back to these guys if there was such a need.",
  "Wireshark": "This friendly <span class=\"blue\">blue shark</span> pup isn’t here by accident. It keeps an eye on every packet flying by, making sure nothing gets stolen, spied on, or forgotten. <b>Wireshark</b> has been my trusty companion for solving network protocol issues, analyzing strange application behavior, and tracking down where those pesky bytes keep leaking. It’s also one of the reasons I fell in love with reverse engineering."
}